; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_2 ?v6 - type_3 ?v8 - type_1)
 	      (pred_3 ?v4 - object ?v8 - type_1)
	      (pred_1 ?v6 - type_3 ?v5 - type_2)
	      (pred_4 ?v6 - type_3 ?v4 - object ?v5 - type_2))

   (:action op_2
       :parameters  (?v6 - type_3 ?v1 ?v2 - type_1)
       :precondition (and  (pred_2 ?v6 ?v1))
       :effect (and  (pred_2 ?v6 ?v2)
		     (not (pred_2 ?v6 ?v1))))

   (:action op_1
       :parameters (?v6 - type_3 ?v7 - object ?v3 - type_1 ?v5 - type_2)
       :precondition  (and  (pred_3 ?v7 ?v3) (pred_2 ?v6 ?v3) (pred_1 ?v6 ?v5))
       :effect (and (pred_4 ?v6 ?v7 ?v5)
		    (not (pred_3 ?v7 ?v3)) 
		    (not (pred_1 ?v6 ?v5))))

   (:action op_3
       :parameters (?v6 - type_3 ?v7 - object ?v3 - type_1 ?v5 - type_2)
       :precondition  (and  (pred_4 ?v6 ?v7 ?v5) (pred_2 ?v6 ?v3))
       :effect (and (pred_3 ?v7 ?v3)
		    (pred_1 ?v6 ?v5)
		    (not (pred_4 ?v6 ?v7 ?v5)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_05 - type_3
obj_04 obj_07 - type_2
obj_08 obj_06 obj_03 - type_1
obj_02 obj_01 obj_09 - object)
(:init
(pred_2 obj_05 obj_03)
(pred_1 obj_05 obj_04)
(pred_1 obj_05 obj_07)
(pred_3 obj_02 obj_03)
(pred_3 obj_01 obj_08)
(pred_3 obj_09 obj_03)
)
(:goal
(and
(pred_3 obj_02 obj_03)
(pred_3 obj_01 obj_06)
(pred_3 obj_09 obj_06)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_4 obj_05 ?b obj_07))))
)
)

; plan
1. (op_1 obj_05 obj_09 obj_03 obj_04)
   deleted: (pred_3 obj_09 obj_03) (pred_1 obj_05 obj_04)
   added: (pred_4 obj_05 obj_09 obj_04)
   goals met: 1 of 3
2. (op_2 obj_05 obj_03 obj_06)
   deleted: (pred_2 obj_05 obj_03)
   added: (pred_2 obj_05 obj_06)
   goals met: 1 of 3
3. (op_3 obj_05 obj_09 obj_06 obj_04)
   deleted: (pred_4 obj_05 obj_09 obj_04)
   added: (pred_3 obj_09 obj_06) (pred_1 obj_05 obj_04)
   goals met: 2 of 3
4. (op_2 obj_05 obj_06 obj_08)
   deleted: (pred_2 obj_05 obj_06)
   added: (pred_2 obj_05 obj_08)
   goals met: 2 of 3
5. (op_1 obj_05 obj_01 obj_08 obj_04)
   deleted: (pred_3 obj_01 obj_08) (pred_1 obj_05 obj_04)
   added: (pred_4 obj_05 obj_01 obj_04)
   goals met: 2 of 3
6. (op_2 obj_05 obj_08 obj_06)
   deleted: (pred_2 obj_05 obj_08)
   added: (pred_2 obj_05 obj_06)
   goals met: 2 of 3
7. (op_3 obj_05 obj_01 obj_06 obj_04)
   deleted: (pred_4 obj_05 obj_01 obj_04)
   added: (pred_3 obj_01 obj_06) (pred_1 obj_05 obj_04)
   goals met: 3 of 3
